# Pandas - DataFrame and series
- Pandas is a powerful data manipulation library in Python. Widely used for data analysis and data cleaning. It provides two primary data structure: series is a one-dimensional array - like object, while a DataFrame is a two-dimensional, size-mutable,and potentially heterogenous tabular data structure with labeled axes(rows and columns)

In [1]:
import pandas as pd

In [3]:
data= [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## create a series from dictionary
data = {'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data, index = index)

a    10
b    20
c    30
dtype: int64

In [3]:
## DataFrame
## Create a DataFrame from a dictionary of list

data = {
      'Name':['soumya','Jhon','Ranjan'],
      'Age':[20,30,29],
      'City':['BBSR','Cuttack','Kolkata']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  soumya   20     BBSR
1    Jhon   30  Cuttack
2  Ranjan   29  Kolkata
<class 'pandas.core.frame.DataFrame'>

In [4]:
import numpy as np

In [5]:
np.array(df)

array([['soumya', 20, 'BBSR'],
       ['Jhon', 30, 'Cuttack'],
       ['Ranjan', 29, 'Kolkata']], dtype=object)

In [10]:
### Create a DataFrame from a list dictionaries
data=[
      {'Name':'soumya','Age':23,'City':'BBSR'},
      {'Name':'Akash','Age':24,'City':'BBSR'},
      {'Name':'Suman','Age':20,'City':'Kolkata'},
      {'Name':'soumya','Age':21,'City':'Cuttack'}
]

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0  soumya   23     BBSR
1   Akash   24     BBSR
2   Suman   20  Kolkata
3  soumya   21  Cuttack
<class 'pandas.core.frame.DataFrame'>

In [13]:
df1=pd.read_csv('customer.csv')
df1.head(5)

  first_name last_name                                email
0       MARY     SMITH        MARY.SMITH@sakilacustomer.org
1   PATRICIA   JOHNSON  PATRICIA.JOHNSON@sakilacustomer.org
2      LINDA  WILLIAMS    LINDA.WILLIAMS@sakilacustomer.org
3    BARBARA     JONES     BARBARA.JONES@sakilacustomer.org
4  ELIZABETH     BROWN   ELIZABETH.BROWN@sakilacustomer.org

In [15]:
## Accessing data from DataFrame
df

     Name  Age     City
0  soumya   23     BBSR
1   Akash   24     BBSR
2   Suman   20  Kolkata
3  soumya   21  Cuttack

In [16]:
df['Name']

0    soumya
1     Akash
2     Suman
3    soumya
Name: Name, dtype: object

In [17]:
df1['first_name']

0           MARY
1       PATRICIA
2          LINDA
3        BARBARA
4      ELIZABETH
         ...
594     TERRENCE
595      ENRIQUE
596      FREDDIE
597         WADE
598       AUSTIN
Name: first_name, Length: 599, dtype: object

In [ ]:
## Row index use to loc
df.loc[0]

Name    soumya
Age         23
City      BBSR
Name: 0, dtype: object

In [20]:
## Column index use to iloc
df.iloc[0]

Name    soumya
Age         23
City      BBSR
Name: 0, dtype: object

In [25]:
np.array(data[0])

array({'Name': 'soumya', 'Age': 23, 'City': 'BBSR'}, dtype=object)

In [26]:
df.iloc[0][2]

C:\Users\admin\AppData\Local\Temp\ipykernel_11232\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'BBSR'

In [30]:
## Acccessing a specified element
df1.at[20,'first_name']

'MICHELLE'

In [32]:
## Accessing a specified element using iat
df.iat[2,2]

'Kolkata'

In [34]:
df1.iat[2,2]

'LINDA.WILLIAMS@sakilacustomer.org'

In [35]:
## Data amnipulation with DataFrame
df

     Name  Age     City
0  soumya   23     BBSR
1   Akash   24     BBSR
2   Suman   20  Kolkata
3  soumya   21  Cuttack

In [39]:
## adding a column
df['Salary']=[20000,30000,40000,3000]
df

     Name  Age     City  Salary
0  soumya   23     BBSR   20000
1   Akash   24     BBSR   30000
2   Suman   20  Kolkata   40000
3  soumya   21  Cuttack    3000

In [ ]:
## Remove a coulmn
df.drop('Salary', axis = 1) ## this is temporary but when use inplace = true

     Name  Age     City
0  soumya   23     BBSR
1   Akash   24     BBSR
2   Suman   20  Kolkata
3  soumya   21  Cuttack

In [43]:
df

     Name  Age     City  Salary
0  soumya   23     BBSR   20000
1   Akash   24     BBSR   30000
2   Suman   20  Kolkata   40000
3  soumya   21  Cuttack    3000

In [44]:
df.drop('Salary', axis = 1, inplace=True)  ## this ispermanent data remove

In [45]:
df

     Name  Age     City
0  soumya   23     BBSR
1   Akash   24     BBSR
2   Suman   20  Kolkata
3  soumya   21  Cuttack

In [46]:
## Add age to the column
df['Age']=df['Age'] +1
df

     Name  Age     City
0  soumya   24     BBSR
1   Akash   25     BBSR
2   Suman   21  Kolkata
3  soumya   22  Cuttack

In [55]:
df.drop(2,inplace=True)
df

     Name  Age     City
3  soumya   22  Cuttack

In [56]:
df1.head(5)

  first_name last_name                                email
0       MARY     SMITH        MARY.SMITH@sakilacustomer.org
1   PATRICIA   JOHNSON  PATRICIA.JOHNSON@sakilacustomer.org
2      LINDA  WILLIAMS    LINDA.WILLIAMS@sakilacustomer.org
3    BARBARA     JONES     BARBARA.JONES@sakilacustomer.org
4  ELIZABETH     BROWN   ELIZABETH.BROWN@sakilacustomer.org

In [63]:
# display the data types of each column
print("Data types:\n",df1.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df1.describe)

Data types:
 first_name    object
last_name     object
email         object
dtype: object
Statistical summary:
 <bound method NDFrame.describe of     first_name  last_name                                  email
0         MARY      SMITH          MARY.SMITH@sakilacustomer.org
1     PATRICIA    JOHNSON    PATRICIA.JOHNSON@sakilacustomer.org
2        LINDA   WILLIAMS      LINDA.WILLIAMS@sakilacustomer.org
3      BARBARA      JONES       BARBARA.JONES@sakilacustomer.org
4    ELIZABETH      BROWN     ELIZABETH.BROWN@sakilacustomer.org
..         ...        ...                                    ...
594   TERRENCE  GUNDERSON  TERRENCE.GUNDERSON@sakilacustomer.org
595    ENRIQUE   FORSYTHE    ENRIQUE.FORSYTHE@sakilacustomer.org
596    FREDDIE     DUGGAN      FREDDIE.DUGGAN@sakilacustomer.org
597       WADE   DELVALLE       WADE.DELVALLE@sakilacustomer.org
598     AUSTIN    CINTRON      AUSTIN.CINTRON@sakilacustomer.org

[599 rows x 3 columns]>

In [64]:
df1.describe()

       first_name last_name                          email
count         599       599                            599
unique        591       599                            599
top        JESSIE     SMITH  MARY.SMITH@sakilacustomer.org
freq            2         1                              1

# Data Manipulation and Analysis with pandas
- Data manipulation and analysis are key tasks in any data science or data analysis project. pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform,and extract insights from data. In this lesson, we will cover various data manipulation and analysis techniques using pandas.

In [65]:
import pandas as pd

In [67]:
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [68]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [69]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [110]:
## change the data type of a column date
df['Date'] = pd.to_datetime(df['Sales Date'])
df.dtypes

Sales Date      datetime64[ns]
Category                object
Value                  float64
Product                 object
Sales                  float64
Region                  object
Sales_fillNA           float64
Value_new                int32
New Value              float64
Date            datetime64[ns]
dtype: object

In [70]:
## handling missing values
df.isnull()

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [71]:
df[df.isnull()]

   Date Category  Value Product  Sales Region
0   NaN      NaN    NaN     NaN    NaN    NaN
1   NaN      NaN    NaN     NaN    NaN    NaN
2   NaN      NaN    NaN     NaN    NaN    NaN
3   NaN      NaN    NaN     NaN    NaN    NaN
4   NaN      NaN    NaN     NaN    NaN    NaN
5   NaN      NaN    NaN     NaN    NaN    NaN
6   NaN      NaN    NaN     NaN    NaN    NaN
7   NaN      NaN    NaN     NaN    NaN    NaN
8   NaN      NaN    NaN     NaN    NaN    NaN
9   NaN      NaN    NaN     NaN    NaN    NaN
10  NaN      NaN    NaN     NaN    NaN    NaN
11  NaN      NaN    NaN     NaN    NaN    NaN
12  NaN      NaN    NaN     NaN    NaN    NaN
13  NaN      NaN    NaN     NaN    NaN    NaN
14  NaN      NaN    NaN     NaN    NaN    NaN
15  NaN      NaN    NaN     NaN    NaN    NaN
16  NaN      NaN    NaN     NaN    NaN    NaN
17  NaN      NaN    NaN     NaN    NaN    NaN
18  NaN      NaN    NaN     NaN    NaN    NaN
19  NaN      NaN    NaN     NaN    NaN    NaN
20  NaN      NaN    NaN     NaN    NaN    NaN
21  NaN      NaN    NaN     NaN    NaN    NaN
22  NaN      NaN    NaN     NaN    NaN    NaN
23  NaN      NaN    NaN     NaN    NaN    NaN
24  NaN      NaN    NaN     NaN    NaN    NaN
25  NaN      NaN    NaN     NaN    NaN    NaN
26  NaN      NaN    NaN     NaN    NaN    NaN
27  NaN      NaN    NaN     NaN    NaN    NaN
28  NaN      NaN    NaN     NaN    NaN    NaN
29  NaN      NaN    NaN     NaN    NaN    NaN
30  NaN      NaN    NaN     NaN    NaN    NaN
31  NaN      NaN    NaN     NaN    NaN    NaN
32  NaN      NaN    NaN     NaN    NaN    NaN
33  NaN      NaN    NaN     NaN    NaN    NaN
34  NaN      NaN    NaN     NaN    NaN    NaN
35  NaN      NaN    NaN     NaN    NaN    NaN
36  NaN      NaN    NaN     NaN    NaN    NaN
37  NaN      NaN    NaN     NaN    NaN    NaN
38  NaN      NaN    NaN     NaN    NaN    NaN
39  NaN      NaN    NaN     NaN    NaN    NaN
40  NaN      NaN    NaN     NaN    NaN    NaN
41  NaN      NaN    NaN     NaN    NaN    NaN
42  NaN      NaN    NaN     NaN    NaN    NaN
43  NaN      NaN    NaN     NaN    NaN    NaN
44  NaN      NaN    NaN     NaN    NaN    NaN
45  NaN      NaN    NaN     NaN    NaN    NaN
46  NaN      NaN    NaN     NaN    NaN    NaN
47  NaN      NaN    NaN     NaN    NaN    NaN
48  NaN      NaN    NaN     NaN    NaN    NaN
49  NaN      NaN    NaN     NaN    NaN    NaN

In [73]:
df.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [76]:
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [111]:
df.isnull().sum()

Sales Date      0
Category        0
Value           0
Product         0
Sales           0
Region          0
Sales_fillNA    0
Value_new       0
New Value       0
Date            0
dtype: int64

In [78]:
df.fillna(0)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    0.0   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    0.0  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    0.0  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    0.0  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    0.0   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    0.0   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    0.0  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [80]:
df_filled = df.fillna(0)

In [81]:
## filling missing values with the mean of the column
df['Sales_fillNA'] =df['Sales'].fillna(df['Sales'].mean())

In [82]:
df

          Date Category  Value   Product  Sales Region  Sales_fillNA
0   2023-01-01        A   28.0  Product1  754.0   East         754.0
1   2023-01-02        B   39.0  Product3  110.0  North         110.0
2   2023-01-03        C   32.0  Product2  398.0   East         398.0
3   2023-01-04        B    8.0  Product1  522.0   East         522.0
4   2023-01-05        B   26.0  Product3  869.0  North         869.0
5   2023-01-06        B   54.0  Product3  192.0   West         192.0
6   2023-01-07        A   16.0  Product1  936.0   East         936.0
7   2023-01-08        C   89.0  Product1  488.0   West         488.0
8   2023-01-09        C   37.0  Product3  772.0   West         772.0
9   2023-01-10        A   22.0  Product2  834.0   West         834.0
10  2023-01-11        B    7.0  Product1  842.0  North         842.0
11  2023-01-12        B   60.0  Product2    0.0   West           0.0
12  2023-01-13        A   70.0  Product3  628.0  South         628.0
13  2023-01-14        A   69.0  Product1  423.0   East         423.0
14  2023-01-15        A   47.0  Product2  893.0   West         893.0
15  2023-01-16        C    0.0  Product1  895.0  North         895.0
16  2023-01-17        C   93.0  Product2  511.0  South         511.0
17  2023-01-18        C    0.0  Product1  108.0   West         108.0
18  2023-01-19        A   31.0  Product2  578.0   West         578.0
19  2023-01-20        A   59.0  Product1  736.0   East         736.0
20  2023-01-21        C   82.0  Product3  606.0  South         606.0
21  2023-01-22        C   37.0  Product2  992.0  South         992.0
22  2023-01-23        B   62.0  Product3  942.0  North         942.0
23  2023-01-24        C   92.0  Product2  342.0   West         342.0
24  2023-01-25        A   24.0  Product2  458.0   East         458.0
25  2023-01-26        C   95.0  Product1  584.0   West         584.0
26  2023-01-27        C   71.0  Product2  619.0  North         619.0
27  2023-01-28        C   56.0  Product2  224.0  North         224.0
28  2023-01-29        B    0.0  Product3  617.0  North         617.0
29  2023-01-30        C   51.0  Product2  737.0  South         737.0
30  2023-01-31        B   50.0  Product3  735.0   West         735.0
31  2023-02-01        A   17.0  Product2  189.0   West         189.0
32  2023-02-02        B   63.0  Product3  338.0  South         338.0
33  2023-02-03        C   27.0  Product3    0.0   East           0.0
34  2023-02-04        C   70.0  Product3  669.0   West         669.0
35  2023-02-05        B   60.0  Product2    0.0   West           0.0
36  2023-02-06        C   36.0  Product3  177.0   East         177.0
37  2023-02-07        C    2.0  Product1    0.0  North           0.0
38  2023-02-08        C   94.0  Product1  408.0  South         408.0
39  2023-02-09        A   62.0  Product1  155.0   West         155.0
40  2023-02-10        B   15.0  Product1  578.0   East         578.0
41  2023-02-11        C   97.0  Product1  256.0   East         256.0
42  2023-02-12        A   93.0  Product3  164.0   West         164.0
43  2023-02-13        A   43.0  Product3  949.0   East         949.0
44  2023-02-14        A   96.0  Product3  830.0   East         830.0
45  2023-02-15        B   99.0  Product2  599.0   West         599.0
46  2023-02-16        B    6.0  Product1  938.0  South         938.0
47  2023-02-17        B   69.0  Product3  143.0   West         143.0
48  2023-02-18        C   65.0  Product3  182.0  North         182.0
49  2023-02-19        C   11.0  Product3  708.0  North         708.0

In [112]:
df.dtypes

Sales Date      datetime64[ns]
Category                object
Value                  float64
Product                 object
Sales                  float64
Region                  object
Sales_fillNA           float64
Value_new                int32
New Value              float64
Date            datetime64[ns]
dtype: object

In [90]:
### Renaming Coulmn
df=df.rename(columns={'Date':'Sales Date'})
df.head(5)

   Sales Date Category  Value   Product  Sales Region  Sales_fillNA
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [92]:
## Chamge data types
df['Value_new'] = df['Value'].fillna(df['Value'].mean()).astype(int)
df.head(5)

   Sales Date Category  Value   Product  Sales Region  Sales_fillNA  Value_new
0  2023-01-01        A   28.0  Product1  754.0   East         754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North         110.0         39
2  2023-01-03        C   32.0  Product2  398.0   East         398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East         522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North         869.0         26

In [93]:
df['New Value'] = df['Value'].apply(lambda x:x*2)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNA,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52.0

In [95]:
## Data aggregating and grouping 
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    40.437500
Product2    52.800000
Product3    52.263158
Name: Value, dtype: float64

In [96]:
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [97]:
df.groupby(['Product','Region'])['Value'].mean()

Product   Region
Product1  East      41.714286
          North      3.000000
          South     50.000000
          West      61.500000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     33.833333
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [100]:
## aggregate multiple functions
grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])
grouped_agg

             mean     sum  count
Region
East    42.307692   550.0     13
North   30.818182   339.0     11
South   62.000000   496.0      8
West    58.166667  1047.0     18

In [101]:
## marging and joining DataFrame
d1= pd.DataFrame({'Key':['A','B','C'],'Value':[1,2,3]})
d2 = pd.DataFrame({'Key':['A','B','D'],'Value':[4,5,6]})

In [102]:
d1

  Key  Value
0   A      1
1   B      2
2   C      3

In [103]:
d2

  Key  Value
0   A      4
1   B      5
2   D      6

In [105]:
# Merge DataFrame on the 'key columns'
pd.merge(d1, d2,on='Key',how ='inner')

  Key  Value_x  Value_y
0   A        1        4
1   B        2        5

In [106]:
pd.merge(d1, d2,on='Key',how ='outer')

  Key  Value_x  Value_y
0   A      1.0      4.0
1   B      2.0      5.0
2   C      3.0      NaN
3   D      NaN      6.0

In [107]:
pd.merge(d1, d2,on='Key',how ='left')

  Key  Value_x  Value_y
0   A        1      4.0
1   B        2      5.0
2   C        3      NaN

In [108]:
pd.merge(d1, d2,on='Key',how ='right')

  Key  Value_x  Value_y
0   A      1.0        4
1   B      2.0        5
2   D      NaN        6

# Reading Data From Different Sources

In [113]:
import pandas as pd
from io import StringIO

In [115]:
Data = '{"employee_name":"Somya","email":"somu@gmail.com","job_profile":[{"designation1":"Data Scientist","experience":3},{"designation2":"Data Analyst","experience":2}]}'
df= pd.read_json(StringIO(Data))

In [116]:
df

,employee_name,email,job_profile
0,Somya,somu@gmail.com,"{'designation1': 'Data Scientist', 'experience..."
1,Somya,somu@gmail.com,"{'designation2': 'Data Analyst', 'experience': 2}"

In [117]:
df.to_json()

'{"employee_name":{"0":"Somya","1":"Somya"},"email":{"0":"somu@gmail.com","1":"somu@gmail.com"},"job_profile":{"0":{"designation1":"Data Scientist","experience":3},"1":{"designation2":"Data Analyst","experience":2}}}'

In [119]:
df.to_json(orient='index')

'{"0":{"employee_name":"Somya","email":"somu@gmail.com","job_profile":{"designation1":"Data Scientist","experience":3}},"1":{"employee_name":"Somya","email":"somu@gmail.com","job_profile":{"designation2":"Data Analyst","experience":2}}}'

In [120]:
df.to_json(orient='records')

'[{"employee_name":"Somya","email":"somu@gmail.com","job_profile":{"designation1":"Data Scientist","experience":3}},{"employee_name":"Somya","email":"somu@gmail.com","job_profile":{"designation2":"Data Analyst","experience":2}}]'

In [ ]:
# read json file
df= pd.read_json("https://www.timestored.com/data/sample/types.json")
df

,english,chinese,japanese,effective,ineffective,no_effect
0,Normal,,,[],"[Rock, Steel]",[Ghost]
1,Fighting,,,"[Normal, Ice, Rock, Dark, Steel]","[Poison, Flying, Psychic, Bug, Fairy]",[Ghost]
2,Flying,,,"[Grass, Fighting, Bug]","[Electric, Rock, Steel]",[]
3,Poison,,,"[Grass, Fairy]","[Poison, Ground, Rock, Ghost]",[Steel]
4,Ground,,,"[Fire, Electric, Poison, Rock, Steel]","[Grass, Bug]",[Flying]
5,Rock,,,"[Fire, Ice, Flying, Bug]","[Fighting, Ground, Steel]",[]
6,Bug,,,"[Grass, Psychic, Dark]","[Fire, Fighting, Poison, Flying, Ghost, Steel,...",[]
7,Ghost,,,"[Psychic, Ghost]",[Dark],[Normal]
8,Steel,,,"[Ice, Rock, Fairy]","[Fire, Water, Electric, Steel]",[]
9,Fire,,,"[Grass, Ice, Bug, Steel]","[Fire, Water, Rock, Dragon]",[]
10,Water,,,"[Fire, Ground, Rock]","[Water, Grass, Dragon]",[]
11,Grass,,,"[Water, Ground, Rock]","[Fire, Grass, Poison, Flying, Bug, Dragon, Steel]",[]
12,Electric,,,"[Water, Flying]","[Electric, Grass, Dragon]",[Ground]
13,Psychic,,,"[Fighting, Poison]","[Psychic, Steel]",[Dark]
14,Ice,,,"[Grass, Ground, Flying, Dragon]","[Fire, Water, Ice, Steel]",[]
15,Dragon,,,[Dragon],[Steel],[Fairy]
16,Dark,,,"[Psychic, Ghost]","[Fighting, Dark, Fairy]",[]
17,Fairy,,,"[Fighting, Dragon, Dark]","[Fire, Poison, Steel]",[]

In [123]:
df.to_csv('output.csv', index=False)

In [127]:
!pip install lxml

Collecting lxml
  Downloading lxml-6.0.1-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading lxml-6.0.1-cp312-cp312-win_amd64.whl (4.0 MB)
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   -- ------------------------------------- 0.3/4.0 MB ? eta -:--:--
   ------- -------------------------------- 0.8/4.0 MB 1.7 MB/s eta 0:00:02
   ------------- -------------------------- 1.3/4.0 MB 1.8 MB/s eta 0:00:02
   --------------- ------------------------ 1.6/4.0 MB 1.8 MB/s eta 0:00:02
   -------------------- ------------------- 2.1/4.0 MB 1.9 MB/s eta 0:00:02
   -------------------------- ------------- 2.6/4.0 MB 2.0 MB/s eta 0:00:01
   ------------------------------- -------- 3.1/4.0 MB 2.1 MB/s eta 0:00:01
   ------------------------------------ --- 3.7/4.0 MB 2.1 MB/s eta 0:00:01
   ------------------------------------ --- 3.7/4.0 MB 2.1 MB/s eta 0:00:01
   ---------------------------------------- 4.0/4.0 MB 1.9 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-6.0.1

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [129]:
# Readthe html file
url= "https://www.fdic.gov/bank-failures/failed-bank-list"
df= pd.read_html(url)

In [131]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [141]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
data= pd.read_html(url,match="Country",header =0)[0]
data

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [150]:
df=data.to_pickle('data')
df
pd.read_pickle('data')

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN